app/controllers/category_controller.rb

SELECT "categories".* FROM "categories"
SELECT 1 AS one FROM "categories" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @categories = Category.all

    if @categories.empty?

INSERT INTO "categories" ("title", "description", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["description", "Test"], ["created_by", 1], ["created_at", "2020-08-20 11:54:05.455352"], ["updated_at", "2020-08-20 11:54:05.455352"]]
---
  def create
    @categories = Category.create!(category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @categories.destroy

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_category
    @categories = Category.find(params[:id])