app/controllers/recipes_controller.rb

  def index
    @recipe = Recipe.all

    if @recipe.empty?
---
SELECT "recipes".* FROM "recipes"
SELECT 1 AS one FROM "recipes" LIMIT ?  [["LIMIT", 1]]

  def create
    @categories.recipes.create!(recipe_params)
---
INSERT INTO "recipes" ("name", "ingredients", "directions", "notes", "tags", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def set_category
    @categories = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]